run/XuAslamStewart_1D/0/T.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

// internalField   uniform 1;

internalField #codeStream
{
    code
    #{        
        const IOdictionary& d = static_cast<const IOdictionary&>(dict);
        const fvMesh& mesh = refCast<const fvMesh>(d.db());
        
        scalarField fld(mesh.nCells(), 0);

        auto T_init = [=](const scalar x) {
            return 1. + 3. * exp(-x*x);
        };

        forAll(fld, i)
        {
            const scalar x = mesh.C()[i][0];

            fld[i] = T_init(x);
        }

        writeEntry(os, "", fld);
    #};

    codeInclude
    #{
        #include "volFields.H"
    #};

    codeOptions
    #{
        -I$(LIB_SRC)/finiteVolume/lnInclude \
        -I$(LIB_SRC)/meshTools/lnInclude
    #};

    codeLibs
    #{
        -lmeshTools \
        -lfiniteVolume
    #};
};

boundaryField
{
    left
    {
        type            zeroGradient;
    }

    right
    {
        type            waveTransmissive;
        gamma           1.4;
        fieldInf        1;
        lInf            1e3;
    }

    emptyWalls
    {
        type            empty;
    }
}

// ************************************************************************* //
