run/XuAslamStewart_1D/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

fluxScheme      Kurganov;

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default         none;
}

laplacianSchemes
{
    default         Gauss linear orthogonal;
}

interpolationSchemes
{
    default         linear;

    // reconstruct(rho) vanAlbada;
    // reconstruct(U)   vanAlbadaV;
    // reconstruct(T)   vanAlbada;

    reconstruct(rho)    vanLeer;
    reconstruct(U)      vanLeerV;
    reconstruct(T)      vanLeer;
    reconstruct(Yi)     vanLeer;
}

snGradSchemes
{
    default         orthogonal;
}


// ************************************************************************* //
